#pragma once
//------------------------------------------------
// 計算ライブラリ [mathlib.h]
//------------------------------------------------
//------------------------------------------------
// インクルードファイル
//------------------------------------------------
#include "main.h"

//------------------------------------------------
// プロトタイプ宣言
//------------------------------------------------

// 対角線の傾き
float SetAngle(float x, float y);

// 対角線の長さ
float SetLength(float x, float y);  

// 乱数の設定(int)
int  SetRand(int iMin, int iMax);

// 回転値がπ(-π)を超えた場合一周分値を戻す(float)
void RotateOverCheck(float &frot);

 // 回転値がπ(-π)を超えた場合一周分値を戻す(Vector3)
void RotateOverCheck(Vector3 &rot);

#pragma once