//------------------------------------------------
// 計算ライブラリ [library.cpp]
//------------------------------------------------
//------------------------------------------------
// インクルードファイル
//------------------------------------------------
#include "mathlib.h"

//------------------------------------------------
//対角線の傾き
//------------------------------------------------
float SetAngle(float x, float y)
{
	return atan2f(x / 2, y / 2);
}

//------------------------------------------------
//対角線の長さ
//------------------------------------------------
float SetLength(float x, float y)
{
	return sqrtf((x / 2) * (x / 2) + (y / 2)*(y / 2));
}

//------------------------------------------------
//乱数の設定(int)
//------------------------------------------------
int SetRand(int iMin, int iMax)
{
	return rand() % (iMax - iMin + 1) + iMin;
}
//------------------------------------------------
//回転値がπ(-π)を超えた場合一周分値を戻す
//------------------------------------------------
void RotateOverCheck(float &frot)
{
	if (frot > D3DX_PI)
	{
		frot -= D3DX_PI * 2.0f;
	}
	if (frot < -D3DX_PI)
	{
		frot += D3DX_PI * 2.0f;
	}
}

//------------------------------------------------
// 回転値がπ(-π)を超えた場合一周分値を戻す
//------------------------------------------------
void RotateOverCheck(Vector3 &rot)
{
	RotateOverCheck(rot.x);
	RotateOverCheck(rot.y);
	RotateOverCheck(rot.z);
}